In [4]:
import pandas as pd
import numpy as np

In [5]:
pd.__version__

'1.5.0'

In [6]:
lst = np.arange(1,6)
s = pd.Series(lst)
s

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [7]:
a = pd.Series(data=["Anurag","Anju","Rajesh","Aditi"],index=[1,2,3,4])
b = pd.Series(index=["Anurag","Anju","Rajesh","Aditi"],data=[1,2,3,4])
print(a,b,sep="\n\n")

1    Anurag
2      Anju
3    Rajesh
4     Aditi
dtype: object

Anurag    1
Anju      2
Rajesh    3
Aditi     4
dtype: int64

In [8]:
steps = {"day1":1000,"day2":2000,"day3":3000,"day4":4000}
pd.Series(steps)

day1    1000
day2    2000
day3    3000
day4    4000
dtype: int64

In [9]:
pd.Series([5]).repeat(6)

0    5
0    5
0    5
0    5
0    5
0    5
dtype: int64

In [10]:
pd.Series([5]).repeat(6).reset_index(drop=True)

0    5
1    5
2    5
3    5
4    5
5    5
dtype: int64

In [11]:
pd.Series([5]).repeat(6).reset_index()

   index  0
0      0  5
1      0  5
2      0  5
3      0  5
4      0  5
5      0  5

In [12]:
s = pd.Series([10,20]).repeat([5,2]).reset_index(drop=True)
s

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

In [13]:
s[4]

10

In [14]:
s[2:4]

2    10
3    10
dtype: int64

In [15]:
s[3:] # s[3:-1] same as s[3:6]

3    10
4    10
5    20
6    20
dtype: int64

In [16]:
s = pd.Series(np.arange(1,8))
s.agg([min,max,sum])

min     1
max     7
sum    28
dtype: int64

In [17]:
sr = pd.Series([1,-2,3,-4,5,-6])
sr.abs()

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [18]:
sr1 = pd.Series([1,-2,3,-4,5,-6])
sr2 = pd.Series([1,2,3,4,5,6,7])
sr1.append(sr2)

C:\Users\ANURAG\AppData\Local\Temp\ipykernel_1376\4118988619.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sr1.append(sr2)

0    1
1   -2
2    3
3   -4
4    5
5   -6
0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [19]:
pd.concat([sr1,sr2],axis=0)

0    1
1   -2
2    3
3   -4
4    5
5   -6
0    1
1    2
2    3
3    4
4    5
5    6
6    7
dtype: int64

In [20]:
sr3 = sr2.append(sr1)
sr3.reset_index(drop=True)

C:\Users\ANURAG\AppData\Local\Temp\ipykernel_1376\448128442.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sr3 = sr2.append(sr1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     1
8    -2
9     3
10   -4
11    5
12   -6
dtype: int64

In [21]:
sr3.astype(float)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
6    7.0
0    1.0
1   -2.0
2    3.0
3   -4.0
4    5.0
5   -6.0
dtype: float64

In [22]:
type(sr2[0])

numpy.int64

In [23]:
sr1 = pd.Series(np.arange(1,11))
print(sr1)
sr1.between(3,7)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

0    False
1    False
2     True
3     True
4     True
5     True
6     True
7    False
8    False
9    False
dtype: bool

In [24]:
s = pd.Series(["Anurag","Anju","Rajesh","Aditi"])
s

0    Anurag
1      Anju
2    Rajesh
3     Aditi
dtype: object

In [25]:
print(s.str.upper())
print(s.str.lower())
for i in s:
    print(len(i))

0    ANURAG
1      ANJU
2    RAJESH
3     ADITI
dtype: object
0    anurag
1      anju
2    rajesh
3     aditi
dtype: object
6
4
6
5

In [26]:
x = pd.Series(["Anurag Sharma    ","Anju","Rajesh","Aditi"])
print(x)
print(x.str.strip())

0    Anurag Sharma
1                 Anju
2               Rajesh
3                Aditi
dtype: object
0    Anurag Sharma
1             Anju
2           Rajesh
3            Aditi
dtype: object

In [27]:
x.str.split(" ")

0    [Anurag, Sharma, , , , ]
1                      [Anju]
2                    [Rajesh]
3                     [Aditi]
dtype: object

In [28]:
x.str.split(" ")[0][0]

'Anurag'

In [29]:
print(x.str.contains("An"))
print(x.str.replace("Rajesh","Rajesh Sharma"))
print(x.str.count("a"))
print(x.str.startswith("A"))
print(x.str.endswith('i'))

0     True
1     True
2    False
3    False
dtype: bool
0    Anurag Sharma
1                 Anju
2        Rajesh Sharma
3                Aditi
dtype: object
0    3
1    0
2    1
3    0
dtype: int64
0     True
1     True
2    False
3     True
dtype: bool
0    False
1    False
2    False
3     True
dtype: bool

In [30]:
x.str.find("Sharma")

0    7
1   -1
2   -1
3   -1
dtype: int64

In [31]:
x.to_list()

['Anurag Sharma    ', 'Anju', 'Rajesh', 'Aditi']

In [32]:
lst = ["Geeks", "For", "Geeks", "is", "portal", "for", "Geeks"]
print(type(pd.DataFrame(lst)))
pd.DataFrame(lst)

<class 'pandas.core.frame.DataFrame'>

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [33]:
data = {"Name":["Anurag","Anju","Rajesh","Aditi"],
        "Age" :[30,28,32,26],
        "IQ":[100,110,120,130],
        }
print(pd.DataFrame(data))
pd.DataFrame(data)[["Name","Age"]]

     Name  Age   IQ
0  Anurag   30  100
1    Anju   28  110
2  Rajesh   32  120
3   Aditi   26  130

     Name  Age
0  Anurag   30
1    Anju   28
2  Rajesh   32
3   Aditi   26

In [34]:
data = {
    "one":[1,2,3,4],
    "two":[10,20,30,40],
    "three":[100,200,300,400],
    "four":[1000,2000,3000,4000]
    }
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [35]:
print(df.loc[0])
print(df.loc[0:2])
print(df.loc[2:])
print(df.loc[2:,"two":"three"])
# print(df.loc[2:,2:3]) #it will give error

one         1
two        10
three     100
four     1000
Name: 0, dtype: int64
   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000
   two  three
2   30    300
3   40    400

In [36]:
print(df.iloc[:2,2:])
print(df.iloc[2:,:-1])
print(df.iloc[:,2:3])
df.iloc[[0,2],[1,3]] # very important line

   three  four
0    100  1000
1    200  2000
   one  two  three
2    3   30    300
3    4   40    400
   three
0    100
1    200
2    300
3    400

   two  four
0   10  1000
2   30  3000

In [37]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [38]:
df[df["one"]>2]

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [39]:
df.loc[df["one"]>2,["two","three"]]

   two  three
2   30    300
3   40    400

In [40]:
df.loc[df['three']<300,["one",'four']]

   one  four
0    1  1000
1    2  2000

In [41]:
l = [22,33,44,55]
df["five"] = l
df

   one  two  three  four  five
0    1   10    100  1000    22
1    2   20    200  2000    33
2    3   30    300  3000    44
3    4   40    400  4000    55

In [42]:
sr = pd.Series(np.arange(111,555,111))
df["six"] = sr
df

   one  two  three  four  five  six
0    1   10    100  1000    22  111
1    2   20    200  2000    33  222
2    3   30    300  3000    44  333
3    4   40    400  4000    55  444

In [43]:
df

   one  two  three  four  five  six
0    1   10    100  1000    22  111
1    2   20    200  2000    33  222
2    3   30    300  3000    44  333
3    4   40    400  4000    55  444

In [44]:
df["seven"] = df["one"]+10
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    22  111     11
1    2   20    200  2000    33  222     12
2    3   30    300  3000    44  333     13
3    4   40    400  4000    55  444     14

In [45]:
del df["six"]
df

   one  two  three  four  five  seven
0    1   10    100  1000    22     11
1    2   20    200  2000    33     12
2    3   30    300  3000    44     13
3    4   40    400  4000    55     14

In [46]:
df.pop("seven")

0    11
1    12
2    13
3    14
Name: seven, dtype: int64

In [47]:
df1 = pd.DataFrame([[1,2],[3,4]], columns=['a','b'])
df2 = pd.DataFrame([[5,6],[7,8]], columns=['a','b'])
df1

   a  b
0  1  2
1  3  4

In [48]:
df1.append(df2)

C:\Users\ANURAG\AppData\Local\Temp\ipykernel_1376\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [49]:
pd.concat([df1,df2],axis=0).reset_index(drop=True)

   a  b
0  1  2
1  3  4
2  5  6
3  7  8

In [50]:
data = {
    "one":[1,2,3,4],
    "two":[10,20,30,40],
    "three":[100,200,300,400],
    "four":[1000,2000,3000,4000]
}
df = pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [51]:
df.drop([0,1],axis=0,inplace=True) # inplace=True will make changes in original dataframe
df

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [52]:
df.drop(["one","three"],axis=1,inplace=True)
df

   two  four
2   30  3000
3   40  4000

In [53]:
df.T

         2     3
two     30    40
four  3000  4000

In [54]:
df.axes

[RangeIndex(start=2, stop=4, step=1), Index(['two', 'four'], dtype='object')]

In [55]:
df.ndim

2

In [56]:
df.dtypes

two     int64
four    int64
dtype: object

In [57]:
df.shape

(2, 2)

In [58]:
d = {
    "Name":["Anurag","Anju","Rajesh","Aditi"],
    "Age":[30,28,32,26],
    "IQ":[100,110,120,130]
}
df = pd.DataFrame(d)
df.head(2) # by default it will show first 5 rows

     Name  Age   IQ
0  Anurag   30  100
1    Anju   28  110

In [59]:
df.tail(2) # by default it will show last 5 rows

     Name  Age   IQ
2  Rajesh   32  120
3   Aditi   26  130

In [60]:
df.empty

False

In [61]:
df = pd.DataFrame()
df.empty

True

In [62]:
df = {
    "one":[1,2,3,4],
    "two":[10,20,30,40],
    "three":[100,200,300,400],
    "four":[1000,2000,3000,4000]
}
df = pd.DataFrame(df)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [63]:
df.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

In [64]:
print(df.mean())
print("-----")
print(df.median())
print("-----")
print(df.var())
print("-----")
print(df.std())
print("-----")
print(df.min())
print("-----")
print(df.max())

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64
-----
one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64
-----
one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
dtype: float64
-----
one         1.290994
two        12.909944
three     129.099445
four     1290.994449
dtype: float64
-----
one         1
two        10
three     100
four     1000
dtype: int64
-----
one         4
two        40
three     400
four     4000
dtype: int64

In [65]:
de = pd.DataFrame({"A":[1,2,2,3,4,4,4,5],"B":[10,20,20,30,40,40,40,50]})
de

   A   B
0  1  10
1  2  20
2  2  20
3  3  30
4  4  40
5  4  40
6  4  40
7  5  50

In [66]:
print(de["A"].mode())
print(de["B"].mode())
print(de.mode())

0    4
Name: A, dtype: int64
0    40
Name: B, dtype: int64
   A   B
0  4  40

In [67]:
data = {
    "one":[1,2,3,4],
    "two":[10,20,30,40],
    "three":[100,200,300,400],
    "four":[1000,2000,3000,4000],
    "five": pd.Series(['A','B','C','D'])
}
df = pd.DataFrame(data)
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

In [68]:
def add_(a,b):
    return a+b
del df["five"]
df.pipe(add_,10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [69]:
df.pipe(lambda x:(x+10)**2)

   one   two   three      four
0  121   400   12100   1020100
1  144   900   44100   4040100
2  169  1600   96100   9060100
3  196  2500  168100  16080100

In [70]:
def mean_(col):
    return col.mean()
def sq_(i):
    return i**2
df.pipe(mean_).pipe(sq_)

one            6.25
two          625.00
three      62500.00
four     6250000.00
dtype: float64

In [71]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [72]:
print(df.apply(np.mean))
print(df.apply(np.max))
print(df.apply(np.sum))

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64
one         4
two        40
three     400
four     4000
dtype: int64
one         10
two        100
three     1000
four     10000
dtype: int64

In [73]:
print(df.apply(lambda x: x.max()-x.min()))

one         3
two        30
three     300
four     3000
dtype: int64

In [74]:
df.applymap(lambda x: x*100) # it will apply on each element of dataframe

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

In [75]:
df = pd.DataFrame({"A":[1.2,3.4,5.6],
                   "B":[3.23,23.3,34.34]})
print(df.applymap(np.int64))
print(df.apply(lambda row: row.mean(),axis=1))
print(df.applymap(np.int64).apply(lambda row: row.mean(),axis=1))

   A   B
0  1   3
1  3  23
2  5  34
0     2.215
1    13.350
2    19.970
dtype: float64
0     2.0
1    13.0
2    19.5
dtype: float64

In [76]:
data = {
    "one":[1,2,3,4],
    "two":[10,20,30,40],
    "three":[100,200,300,400],
    "four":[1000,2000,3000,4000]
}
df = pd.DataFrame(data)
print(df)
print(df.reindex([0,2,3,1]))
print(df.reindex(columns=['one','three','two','four']))
df.reindex([0,2,3,1],columns=['one','three','two','four'])

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
   one  two  three  four
0    1   10    100  1000
2    3   30    300  3000
3    4   40    400  4000
1    2   20    200  2000
   one  three  two  four
0    1    100   10  1000
1    2    200   20  2000
2    3    300   30  3000
3    4    400   40  4000

   one  three  two  four
0    1    100   10  1000
2    3    300   30  3000
3    4    400   40  4000
1    2    200   20  2000

In [77]:
print(df.rename(columns={'one':'A','two':'B','three':'C','four':'D'}))
df.rename(index={0:'a',1:'b',2:'c',3:'d'})

   A   B    C     D
0  1  10  100  1000
1  2  20  200  2000
2  3  30  300  3000
3  4  40  400  4000

   one  two  three  four
a    1   10    100  1000
b    2   20    200  2000
c    3   30    300  3000
d    4   40    400  4000

In [78]:
df = pd.DataFrame({"one":[11,55,31,41],
                   "two":[10,20,30,40],
                   "three":[100,200,300,400],
                   "four":[1000,2000,3000,4000]})
print(df.sort_values(by='one'))
print("-------")
print(df.sort_values(by=0,axis=1))
print("-------")
print(df.sort_values(by='one',ascending=False,kind='heapsort'))

   one  two  three  four
0   11   10    100  1000
2   31   30    300  3000
3   41   40    400  4000
1   55   20    200  2000
-------
   two  one  three  four
0   10   11    100  1000
1   20   55    200  2000
2   30   31    300  3000
3   40   41    400  4000
-------
   one  two  three  four
1   55   20    200  2000
3   41   40    400  4000
2   31   30    300  3000
0   11   10    100  1000

In [79]:
cricket = pd.DataFrame({"Team": ["India", "Australia", "South Africa", "India", "Australia", "South Africa"],
                        "Rank": [1, 2, 3, 4, 5, 6],
                        "Year": [2011, 2011, 2011, 2012, 2012, 2012],
                        "Points": [874, 787, 741, 935, 876, 789]})
cricket

           Team  Rank  Year  Points
0         India     1  2011     874
1     Australia     2  2011     787
2  South Africa     3  2011     741
3         India     4  2012     935
4     Australia     5  2012     876
5  South Africa     6  2012     789

In [80]:
cricket.groupby('Team').groups

{'Australia': [1, 4], 'India': [0, 3], 'South Africa': [2, 5]}

In [81]:
cricket.groupby(['Team','Year']).get_group(('India',2011))

    Team  Rank  Year  Points
0  India     1  2011     874

In [82]:
cricket.groupby(['Team','Year']).groups

{('Australia', 2011): [1], ('Australia', 2012): [4], ('India', 2011): [0], ('India', 2012): [3], ('South Africa', 2011): [2], ('South Africa', 2012): [5]}

In [83]:
df =cricket
print(df.groupby(['Team'])['Points'].sum())
df.groupby(['Team']).sum()['Points']

Team
Australia       1663
India           1809
South Africa    1530
Name: Points, dtype: int64

Team
Australia       1663
India           1809
South Africa    1530
Name: Points, dtype: int64

In [84]:
df.groupby(['Team']).sum()['Points'].sort_values(ascending=False)

Team
India           1809
Australia       1663
South Africa    1530
Name: Points, dtype: int64

In [85]:
groups = df.groupby(['Team'])
groups['Points'].agg([np.sum,np.mean,np.std,np.max,np.min])

               sum   mean        std  amax  amin
Team
Australia     1663  831.5  62.932504   876   787
India         1809  904.5  43.133514   935   874
South Africa  1530  765.0  33.941125   789   741

In [86]:
df.drop(index=5,inplace=True)
df.groupby(['Team']).filter(lambda x: len(x) == 1)

           Team  Rank  Year  Points
2  South Africa     3  2011     741

In [87]:
df.groupby(['Team']).filter(lambda x: len(x) == 2)

        Team  Rank  Year  Points
0      India     1  2011     874
1  Australia     2  2011     787
3      India     4  2012     935
4  Australia     5  2012     876

In [88]:
df = pd.read_csv("football.csv")
df.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 660 entries, 0 to 659
Data columns (total 15 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Country                  660 non-null    object
 1   League                   660 non-null    object
 2   Club                     660 non-null    object
 3   Player Names             660 non-null    object
 4   Matches_Played           660 non-null    int64
 5   Substitution             660 non-null    int64
 6   Mins                     660 non-null    int64
 7   Goals                    660 non-null    int64
 8   xG                       660 non-null    float64
 9   xG Per Avg Match         660 non-null    float64
 10  Shots                    660 non-null    int64
 11  OnTarget                 660 non-null    int64
 12  Shots Per Avg Match      660 non-null    float64
 13  On Target Per Avg Match  660 non-null    float64
 14  Year                     660 non-null    int64
dtypes: float64(4), int64(7), object(4)
memory usage: 77.5+ KB

In [90]:
df.isnull()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
655,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
656,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
657,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
658,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
659,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False

In [91]:
df.isnull().sum()

Country                    0
League                     0
Club                       0
Player Names               0
Matches_Played             0
Substitution               0
Mins                       0
Goals                      0
xG                         0
xG Per Avg Match           0
Shots                      0
OnTarget                   0
Shots Per Avg Match        0
On Target Per Avg Match    0
Year                       0
dtype: int64

In [92]:
df.describe(percentiles=[.80])

,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
count,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000,660.000000
mean,22.371212,3.224242,2071.416667,11.810606,10.089606,0.476167,64.177273,28.365152,2.948015,1.315652,2018.363636
std,9.754658,3.839498,900.595049,6.075315,5.724844,0.192831,34.941622,16.363149,0.914906,0.474239,1.367700
min,2.000000,0.000000,264.000000,2.000000,0.710000,0.070000,5.000000,2.000000,0.800000,0.240000,2016.000000
50%,24.000000,2.000000,2245.500000,11.000000,9.285000,0.435000,62.000000,26.000000,2.845000,1.250000,2019.000000
80%,32.000000,6.000000,2915.800000,15.000000,14.076000,0.610000,90.000000,39.000000,3.600000,1.630000,2020.000000
max,38.000000,26.000000,4177.000000,42.000000,32.540000,1.350000,208.000000,102.000000,7.200000,3.630000,2020.000000

In [93]:
df["Mins"].quantile(.99)

3520.0199999999995

In [94]:
de=df.copy()
de.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016

In [95]:
de['Year+100'] = de['Year']+100
de.head()

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year,Year+100
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016,2116
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016,2116
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016,2116
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016,2116
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016,2116

In [96]:
df["Player Names"].value_counts()

Andrea Belotti     5
Lionel Messi       5
Luis Suarez        5
Andrej Kramaric    5
Ciro Immobile      5
                  ..
Francois Kamano    1
Lebo Mothiba       1
Gaetan Laborde     1
Falcao             1
Cody Gakpo         1
Name: Player Names, Length: 444, dtype: int64

In [97]:
df["Player Names"].unique()

array(['Juanmi Callejon', 'Antoine Griezmann', 'Luis Suarez',
       'Ruben Castro', 'Kevin Gameiro', 'Cristiano Ronaldo',
       'Karim Benzema', 'Neymar ', 'Iago Aspas', 'Sergi Enrich',
       'Aduriz ', 'Sandro Ramlrez', 'Lionel Messi', 'Gerard Moreno',
       'Morata', 'Wissam Ben Yedder', 'Willian Jose', 'Andone ',
       'Cedric Bakambu', 'Isco', 'Mohamed Salah', 'Gregoire Defrel',
       'Ciro Immobile', 'Nikola Kalinic', 'Dries Mertens',
       'Alejandro Gomez', 'Jose CallejOn', 'Iago Falque',
       'Giovanni Simeone', 'Mauro Icardi', 'Diego Falcinelli',
       'Cyril Thereau', 'Edin Dzeko', 'Lorenzo Insigne',
       'Fabio Quagliarella', 'Borriello ', 'Carlos Bacca',
       'Gonzalo Higuain', 'Keita Balde', 'Andrea Belotti', 'Fin Bartels',
       'Lars Stindl', 'Serge Gnabry', 'Wagner ', 'Andrej Kramaric',
       'Florian Niederlechner', 'Robert Lewandowski', 'Emil Forsberg',
       'Timo Werner', 'Nils Petersen', 'Vedad Ibisevic', 'Mario Gomez',
       'Maximilian Philipp', 'A\x81dam Szalai',
       'Pierre-Emerick Aubameyang', 'Guido Burgstaller', 'Max Kruse',
       'Chicharito ', 'Anthony Modeste', 'Arjen Robben', 'Alexis Sanchez',
       'Romelu Lukaku', 'Harry Kane', 'Jamie Vardy', 'Christian Benteke',
       'Pedro None', 'Eden Hazard', 'Roberto Firmino', 'Sadio Mane',
       'Philippe Coutinho', 'Diego Costa', 'Dele Alli', 'Sergio Aguero',
       'Jermain Defoe', 'Fernando Llorente', 'Michail Antonio',
       'Zlatan Ibrahimovic', 'Olivier Giroud', 'Son Heung-Min',
       'Joshua King', 'Diego Souza', 'Pablo ', 'Robinho ', 'Kempes ',
       'Gabriel Jesus', 'Bruno Rangel ', 'Rogerio ', 'Vitor Bueno',
       'Marinho ', 'Grafite ', 'Andres Chavez', 'Cicero Semedo', 'Sassa',
       'Giorgian de Arrascaeta', 'Keno ', 'Fred ', 'Kleber Gladiador',
       'Pottker ', 'Jonathan Copete', 'Ricardo Oliveira',
       'Angel Rodriguez', 'Gareth Bale', 'Rodrigo None', 'Sergio Leon',
       'Maxi Gomez', 'Mikel Oyarzabal', 'Willian Josa', 'Simone Zaza',
       'Portu ', 'Cristhian Stuani', 'Santi Mina', 'Morales ', 'Munir ',
       'Jose Callejon', 'Sergej Milinkovic-Savic', 'Duvan Zapata',
       'Paulo Dybala', 'Mirco Antenucci', 'Luis Alberto',
       'Roberto Inglese', 'Josip Ilicic', 'Ivan Perisic',
       'Leonardo Pavoletti', 'Kevin Lasagna', 'Niclas Fullkrug',
       'Salomon Kalou', 'Thorgan Hazard', 'Jean-Kevin Augustin',
       'Sandro Wagner ', 'Leon Bailey', 'Daniel Didavi',
       'Alfred Finnbogason', 'Davie Selke', 'Mark Uth',
       'Michael Gregoritsch', 'Julian Brandt', 'Kevin Volland', 'Roger ',
       'Arthur Caike', 'Everton ', 'Hernanes ', 'Luiz Fernando',
       'Wellington Paulista', 'Santiago Trellez', 'Jo', 'Thiago Neves',
       'Bruno Henrique', 'Dudu ', 'Diego ', 'Lucca ', 'Henrique Dourado',
       'Andre', 'Edigar Junio ', 'Junior  Dutra', 'Jaime Mata',
       'Inaki Williams', 'Chimy Avila', 'Raul de Tomas', 'Pablo Sarabia',
       'Borja Iglesias', 'Jorge Molina', 'Charles', 'Arkadiusz Milik',
       'Mandzukic None', 'Andrea Petagna', 'Francesco Caputo',
       'Stephan El Shaarawy', 'Gervinho ', 'Krzysztof Piatek',
       'Alassane Plea', 'Kai Havertz', 'Luka Jovic', 'Ante Rebic',
       'Jadon Sancho', 'Ondrej Duda', 'Paco Alcacer', 'Benito Raman',
       'Wout Weghorst', 'Ishak Belfodil', 'Marco Reus',
       'Jean-Philippe Mateta', 'Sebastien Haller', 'Yussuf Poulsen',
       'Angel Di Maria', 'Remi Oudin', 'Nicolas Pepe', 'Emiliano Sala',
       'Jonathan Bamba', "M'Baye Niang", 'Edinson Cavani',
       'Stephane Bahoken', 'Max Gradel', 'Florian Thauvin',
       'Kylian Mbappe-Lottin', 'Wahbi Khazri', 'Falcao ',
       'Gaetan Laborde', 'Andy Delort', 'Moussa Dembele', 'Memphis Depay',
       'Lebo Mothiba', 'Francois Kamano', 'Luka Milivojevic',
       'Paul Pogba', 'Ashley Barnes', 'Glenn Murray', 'Richarlison ',
       'Callum Wilson', 'Gylfi Sigurdsson', 'Raheem Sterling',
       'Ayoze Perez', 'Alexandre Lacazette', 'Raul Jimenez',
       'Lucas Paqueta', 'Juan Cazares', 'Deyverson ', 'Leandro Damiao ',
       'Yago Pikachu', 'Rodrygo ', 'Andres Rios', 'Roger Guedes ',
       'Leandro Pereira ', 'Pedro ', 'Nico Lupez', 'Nene ', 'Gilberto ',
       'Henrique ', 'Willian ', 'Gabriel Barbosa', 'Diego Rossi',
       'Josef Martinez', 'Chris Wondolowski', 'Nani ', 'Kacper Przybylko',
       'Kei Kamara', 'C.J. Sapong', 'Gyasi Zardes', 'Heber ',
       'Mauro Manotas', 'Brian Fernandez', 'Alejandro Pozuelo',
       'Felipe Gutierrez', 'Jordan Morris', 'Raul Ruidiaz',
       'Jozy Altidore', 'Carlos Vela', 'Nemanja Nikolic',
       'Alexandru Mitrita', 'Joselu', 'Carlos Fernandez', 'Ante Budimir',
       'Lucas Perez', 'Loren Moron', 'Raul Garcla', 'Morata ',
       'Sergio Ramos', 'Lucas Ocampos', 'Cazorla ', 'Pote ',
       'Tiquinho Soares', 'Eduardo Mancha', 'Paulinho ', 'Alex Telles',
       'Bruno Viana', 'Mehrdad Mohammadi', 'Carlos Valenzuela',
       'Ruben Lameiras', 'Moussa Marega', 'Gian-Luca Waldschmidt',
       'Samuel Lino', 'Andre Andre', 'Mehdi Taremi', 'Carlos Vinicius',
       'Sergio Oliveira', 'Douglas Tanque', 'Fabio Abreu',
       'Brayan Riascos', 'Alex Telles ', 'Fabio Martins',
       'Haris  Seferovic', 'Joao Teixeira', 'Bruno Fernandes',
       'Angel Gomes', 'Toni MartÃ\xadnez', 'Pizzi ', 'Bozhidar Kraev',
       'Sandro Lima', 'Rodrigo Pinho', 'Thiago Santana', 'Trincao ',
       'Andraz Sporar', 'Ricardo Horta', 'Bruno Duarte', 'Nuno Santos',
       'Domenico Berardi', 'Joao Pedro', 'Andreas Cornelius',
       'Marco Mancosu', 'Lautaro Martrinez', 'Luis Muriel',
       'Gianluca Lapadula', 'Marcus Thuram', 'Rouwen Hennings',
       'Andre Silva', 'Erling Haaland', 'Jhon Cordoba', 'Robin Quaison',
       'Sebastian Andersson', 'Dimitri Payet', 'Kasper Dolberg',
       'Adrien Thomasson', 'Dario Benedetto', 'Ludovic Ajorque',
       'Islam Slimani', 'Adrien Hunou', 'Denis Bouanga',
       'Sehrou Guirassy', 'Ã\x81ngel Di Maria', 'Habib Diallo',
       'Victor Osimhen', 'Dominic Calvert-Lewin', 'Kevin De Bruyne',
       'Chris Wood', 'Anthony Martial', 'Riyad Mahrez', 'Marcus Rashford',
       'Danny Ings', 'Richarlison  ', 'Teemu Pukki', 'Tammy Abraham',
       'Thiago Galhardo', 'Paolo Guerrero', 'Pepe', 'Michael ',
       'Carlos Sanchez', 'Everaldo ', 'Artur ', 'Marcelo  Cirino',
       'Yeferson Soteldo', 'Eduardo Sasha', 'Rafael Moura', 'Antony None',
       'Quincy Promes', 'Dusan Tadic', 'Armando Broja', 'Steven Berghuis',
       'Michael de Leeuw', 'Lois Openda', 'Danilo Nome', 'Lennart Thy',
       'Donyell Malen', 'Noni Madueke', 'Davy Klaassen',
       'Oussama Tannane', 'Vaclav Cerny', 'Vangelis Pavlidis',
       'Henk Veerman', 'Abdou Harroui', 'Rai Vloet', 'Lassina Traore',
       'Georgios Giakoumakis', 'Alex Pozuelo', 'Kevin Molino',
       'Damir Kreilach', 'Bradley Wright-Phillips', 'Nicolas Lodeiro',
       'Daryl Dike', 'Cristian Pavon', 'Chris Mueller', 'Romell Quioto',
       'Gustavo Bou', 'Robert Beric', 'Ayo Akinola', 'Jeremy Ebobisse',
       'Diego Valeri', 'Youssef   En-Nesyri', 'Carlos Soler',
       'Cristian Tello', 'Esteban Burgos', 'Joao Felix',
       'Federico Valverde', 'Kike GarcIa', 'Ansu Fati', 'Roberto Soriano',
       'Gaetano Castrovilli', 'Henrikh Mkhitaryan', 'Jordan Veretout',
       'Lautaro MartInez', 'Hirving Lozano', 'Lucas Alario', 'Bas Dost',
       'Dani Olmo', 'Ellyes Skhiri', 'Thomas Muller', 'Andre Hahn',
       'Daniel Caligiuri', 'Matheus Cunha', 'Ludovic Blas', 'Karl Toko',
       'Burak Yilmaz', 'Ibrahima Niane', 'Boulaye Dia', 'Moise Kean',
       'Ignatius Ganago', 'Irvin Cardona', 'Wissam Ben', 'Amine Gouiri',
       'Mama Balde', 'Gael Kakuta', 'James Ward-Prowse', 'Diogo Jota',
       'Wilfried Zaha', 'Jack Grealish', 'Jarrod Bowen',
       'Patrick Bamford', 'Danny Ings ', 'Neal Maupay', 'Ollie Watkins',
       'Luciano ', 'Vinicius ', 'Raphael Veiga', 'Luiz Adriano',
       'Cleber ', 'German Cano', 'Brenner None', 'Matheus Babi',
       'Alerrandro ', 'Claudinho ', 'Robson', 'Renato Kayzer',
       'Donny van de Beek', 'Teun Koopmeiners', 'Cantalapiedra ',
       'Bryan Linssen', 'Matavz ', 'Oussama Idrissi', 'Chidera Ejuke',
       'Myron Boadu', 'Klaas-Jan Huntelaar', 'Haris Vuckic',
       'Gyrano Kerk', 'Denzel Dumfries', 'Cyriel Dessers ', 'Cody Gakpo'],
      dtype=object)

In [98]:
df["Player Names"].nunique()

444

In [99]:
df.dropna() # it will drop all rows which have null values
# df.dropna(axis=1) # it will drop all columns which have null values
# df.dropna(how='all') # it will drop all rows which have all null values

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
0,Spain,La Liga,(BET),Juanmi Callejon,19,16,1849,11,6.62,0.34,48,20,2.47,1.03,2016
1,Spain,La Liga,(BAR),Antoine Griezmann,36,0,3129,16,11.86,0.36,88,41,2.67,1.24,2016
2,Spain,La Liga,(ATL),Luis Suarez,34,1,2940,28,23.21,0.75,120,57,3.88,1.84,2016
3,Spain,La Liga,(CAR),Ruben Castro,32,3,2842,13,14.06,0.47,117,42,3.91,1.40,2016
4,Spain,La Liga,(VAL),Kevin Gameiro,21,10,1745,13,10.65,0.58,50,23,2.72,1.25,2016
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
655,Netherlands,Eredivisie,(UTR),Gyrano Kerk,24,0,2155,10,7.49,0.33,50,18,2.20,0.79,2020
656,Netherlands,Eredivisie,(AJA),Quincy Promes,18,2,1573,12,9.77,0.59,56,30,3.38,1.81,2020
657,Netherlands,Eredivisie,(PSV),Denzel Dumfries,25,0,2363,7,5.72,0.23,45,14,1.81,0.56,2020
658,Netherlands,Eredivisie,None,Cyriel Dessers,26,0,2461,15,14.51,0.56,84,43,3.24,1.66,2020
659,Netherlands,Eredivisie,(PSV),Cody Gakpo,14,11,1557,7,4.43,0.27,38,15,2.32,0.92,2020

In [100]:
df = df.append({'Player Names':'Anurag','Year':None,'Goals':100,'Mins':1000},ignore_index=True)

C:\Users\ANURAG\AppData\Local\Temp\ipykernel_1376\2002302595.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'Player Names':'Anurag','Year':None,'Goals':100,'Mins':1000},ignore_index=True)

In [101]:
mis = round(df["Year"].mean(),2)
df["Year"].fillna(mis)

0      2016.00
1      2016.00
2      2016.00
3      2016.00
4      2016.00
        ...
656    2020.00
657    2020.00
658    2020.00
659    2020.00
660    2018.36
Name: Year, Length: 661, dtype: float64

In [102]:
print(len(df))
print(df["League"].mode()[0])
df["League"].fillna(df["League"].mode()[0],inplace=True)

661
Bundesliga

In [103]:
df.isnull().sum()

Country                    1
League                     0
Club                       1
Player Names               0
Matches_Played             1
Substitution               1
Mins                       0
Goals                      0
xG                         1
xG Per Avg Match           1
Shots                      1
OnTarget                   1
Shots Per Avg Match        1
On Target Per Avg Match    1
Year                       1
dtype: int64

In [104]:
df.sample(10) # it will give 10 random rows

,Country,League,Club,Player Names,Matches_Played,Substitution,Mins,Goals,xG,xG Per Avg Match,Shots,OnTarget,Shots Per Avg Match,On Target Per Avg Match,Year
70,England,Premier League,(ATL),Diego Costa,35.0,0.0,3232,20,16.67,0.49,111.0,41.0,3.26,1.21,2016
182,Spain,La Liga,(CEL),Iago Aspas,26.0,1.0,2369,20,12.47,0.50,69.0,32.0,2.77,1.28,2018
67,England,Premier League,(LIV),Roberto Firmino,34.0,1.0,3228,11,10.87,0.32,104.0,43.0,3.06,1.27,2016
87,Brazil,Campeonato Brasileiro SÃ©rie A,(SAP),Vitor Bueno,32.0,1.0,2670,10,9.27,0.33,73.0,30.0,2.60,1.07,2016
72,England,Premier League,(MNC),Sergio Aguero,25.0,6.0,2444,21,22.38,0.87,139.0,51.0,5.40,1.98,2016
131,Italy,Serie A,(CAG),Giovanni Simeone,36.0,2.0,3157,14,13.29,0.40,107.0,37.0,3.22,1.11,2017
18,Spain,La Liga,(SOC),Cedric Bakambu,17.0,9.0,1633,10,8.08,0.47,50.0,26.0,2.91,1.51,2016
229,Germany,Bundesliga,(CHE),Timo Werner,29.0,1.0,2582,16,15.49,0.57,107.0,39.0,3.94,1.43,2018
93,Brazil,Campeonato Brasileiro SÃ©rie A,(FLA),Giorgian de Arrascaeta,30.0,1.0,2423,9,7.65,0.30,75.0,24.0,2.94,0.94,2016
22,Italy,Serie A,(LAZ),Ciro Immobile,35.0,1.0,3294,22,19.76,0.57,136.0,98.0,3.92,2.83,2016

In [105]:
df.to_csv("football2.csv",index=False) # it will save dataframe to csv file
# index=False will not save index column

In [106]:
df.to_csv("football2.csv")

In [107]:
import matplotlib
import pandas_profiling as pp

In [109]:
df = pd.read_csv("football.csv")
report = pp.ProfileReport(df)

In [111]:
report.to_file("football.html")

Summarize dataset:  73%|███████▎  | 16/22 [00:02<00:01,  3.46it/s, Calculate auto correlation]              C:\Users\ANURAG\AppData\Roaming\Python\Python310\site-packages\multimethod\__init__.py:315: FutureWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  return func(*args, **kwargs)
Summarize dataset: 100%|██████████| 124/124 [00:32<00:00,  3.76it/s, Completed]
Generate report structure: 100%|██████████| 1/1 [00:11<00:00, 11.29s/it]
Render HTML: 100%|██████████| 1/1 [00:11<00:00, 11.17s/it]
Export report to file: 100%|██████████| 1/1 [00:00<00:00, 15.09it/s]